tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "remotemobprogramming/brew"
brew "giflib"
brew "openexr"
brew "webp"
brew "aom"
brew "aws-iam-authenticator"
brew "xz"
brew "awscli"
brew "boost"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "pcre"
brew "glib"
brew "lzo"
brew "pixman"
brew "cairo"
brew "gmp"
brew "coreutils"
brew "libtool"
brew "libidn2"
brew "libtasn1"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "docker-machine"
brew "python@3.10"
brew "doitlive"
brew "wxwidgets"
brew "erlang"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "gobject-introspection"
brew "graphite2"
brew "harfbuzz"
brew "lame"
brew "little-cms2"
brew "openjpeg"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsamplerate"
brew "libsoxr"
brew "libvpx"
brew "opencore-amr"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "ghostscript", link: false
brew "gifsicle"
brew "pcre2"
brew "git"
brew "glances"
brew "glew"
brew "gnu-sed"
brew "gnupg"
brew "go"
brew "sdl2_image"
brew "gource"
brew "htop"
brew "ilmbase", link: true
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "tcl-tk"
brew "python@3.8"
brew "libomp"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "krakend"
brew "kubernetes-cli"
brew "krew"
brew "minikube"
brew "mkdocs"
brew "mysql"
brew "node"
brew "nvm"
brew "openjdk"
brew "openapi-generator"
brew "perl"
brew "postgresql"
brew "pre-commit"
brew "pyenv"
brew "rabbitmq"
brew "rtmpdump"
brew "sonar-scanner"
brew "sonarqube"
brew "sops"
brew "sourcekitten"
brew "termtosvg"
brew "vim", link: false
brew "wget"
brew "xcproj"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "jakehilborn/jakehilborn/displayplacer"
brew "remotemobprogramming/brew/mob"
cask "adoptopenjdk8"
cask "cakebrew"
cask "chromium"
cask "firefox"
cask "font-hack-nerd-font"
cask "gimp"
cask "keepassxc"
cask "visual-studio-code"
