tap "adoptopenjdk/openjdk"
tap "caarlos0/tap"
tap "coursier/formulas"
tap "derailed/k9s"
tap "gabrie30/utils"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
tap "noovolari/brew"
tap "oven-sh/bun"
tap "remotemobprogramming/brew"
# Run your GitHub Actions locally
brew "act"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Simple, modern, secure file encryption
brew "age"
# Library and utilities for processing GIFs
brew "giflib"
# General-purpose data compression with high compression ratio
brew "xz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# High dynamic-range image file format
brew "openexr"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Software library to render fonts
brew "freetype"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Core application library for C
brew "glib"
# Real-time data compression library
brew "lzo"
# Low-level library for pixel manipulation
brew "pixman"
# Vector graphics library with cross-device output support
brew "cairo"
# Smart font renderer for non-Roman scripts
brew "graphite2"
# OpenType text shaping engine
brew "harfbuzz"
# Google's own build tool
brew "bazel"
# Collection of portable C++ source libraries
brew "boost"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# ASN.1 structure parser library
brew "libtasn1"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Emacs text editor
brew "emacs"
# Emacs dependency management
brew "cask"
# C parser in Python
brew "pycparser"
# Ruby environment tool
brew "chruby"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Isolated development environments using Docker
brew "docker-compose"
# Create Docker hosts locally and on cloud providers
brew "docker-machine"
# Text processing system for reStructuredText
brew "docutils"
# Replay stored shell commands for live presentations
brew "doitlive"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Generic library support script
brew "libtool"
# Programming language for highly scalable real-time systems
brew "erlang"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# VP8/VP9 video codec
brew "libvpx"
# Audio codec
brew "opus"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# H.264/AVC encoder
brew "x264"
# H.265/HEVC encoder
brew "x265"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Ogg Bitstream Library
brew "libogg"
# Free lossless audio codec
brew "flac"
# Fast and simple Node.js version manager
brew "fnm"
# Minimalistic plugin API for video effects
brew "frei0r"
# Implementation of the Unicode BiDi algorithm
brew "fribidi"
# Integer Set Library for the polyhedral model
brew "isl"
# C library for multiple-precision floating-point computations
brew "mpfr"
# C library for the arithmetic of high precision complex numbers
brew "libmpc"
# GNU compiler collection
brew "gcc"
# Library for encoding and decoding .avif files
brew "libavif"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Graphics library to dynamically manipulate images
brew "gd"
# GitHub command-line tool
brew "gh"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# Alternative to top/htop
brew "glances"
# OpenGL Extension Wrangler Library
brew "glew"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Library for USB device access
brew "libusb"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Development kit for the Java programming language
brew "openjdk"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Utilities for manipulating PostScript documents
brew "psutils"
# GNU troff text-formatting system
brew "groff"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# OpenEXR ILM Base libraries (high dynamic-range image file format)
brew "ilmbase"
# Open h.265 video codec implementation
brew "libde265"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Open-source distributed event streaming platform
brew "kafka"
# Ultra-High performance API Gateway built in Go
brew "krakend"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# C/C++ seam carving library
brew "liblqr"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Library for reading RAW files from digital photo cameras
brew "libraw"
# Library for sample rate conversion of audio data
brew "libsamplerate"
# Vorbis general audio compression codec
brew "libvorbis"
# C library for files containing sampled sound
brew "libsndfile"
# High quality, one-dimensional sample-rate conversion library
brew "libsoxr"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Run a Kubernetes cluster locally
brew "minikube"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Record and playback videos and perform simple edits
brew "mjpegtools"
# Project documentation with Markdown
brew "mkdocs"
# Deep clean and optimize your Mac
brew "mole"
# Open source relational database management system
brew "mysql"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Audio codecs extracted from Android open source project
brew "opencore-amr"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# OpenShift command-line interface tools
brew "openshift-cli"
# Compression/decompression library aiming for high speed
brew "snappy"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Perl compatible regular expressions library
brew "pcre"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Object-relational database system
brew "postgresql@14"
# Convert bitmaps to vector graphics
brew "potrace"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# QR Code generation
brew "qrencode"
# Messaging and streaming broker
brew "rabbitmq"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Audio time stretcher tool and library
brew "rubberband"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# SOcket CAT: netcat on steroids
brew "socat"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Manage code quality
brew "sonarqube"
# Editor of encrypted files
brew "sops"
# Audio codec designed for speech
brew "speex"
# Record terminal sessions as SVG animations
brew "termtosvg"
# Open video compression format
brew "theora"
# Upgrade all the things
brew "topgrade"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Your favorite rust -> wasm workflow tool!
brew "wasm-pack"
# Internet file retriever
brew "wget"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# High-performance, high-quality MPEG-4 video library
brew "xvid"
# Linter for YAML files
brew "yamllint"
# Centralized server for distributed coordination of services
brew "zookeeper"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Command-line tools for building and debugging Android apps
cask "android-commandlinetools"
# Open source IDE for exploring and testing APIs
cask "bruno"
# GUI app for Homebrew
cask "cakebrew"
# Free and open-source web browser
cask "chromium"
cask "color-oracle"
# Online diagram software
cask "drawio"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
cask "font-hack-nerd-font"
# Free and open-source image editor
cask "gimp"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Open-source keystroke visualiser
cask "keycastr"
# Cloud credentials manager
cask "leapp"
# App for designing HTML5 Scalable Vector Graphics
cask "macsvg"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Colour picker for colours onscreen
cask "pika"
# LaTeX editor
cask "texstudio"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Create diagrams manually, or import external data for analysis
cask "yed"
vscode "aar.xlf-editor"
vscode "adisreyaj.swagger-snippets"
vscode "adrieankhisbe.vscode-ndjson"
vscode "af4jm.vscode-icalendar"
vscode "ahmadalli.vscode-nginx-conf"
vscode "alfnielsen.vsc-organize-imports"
vscode "alfnielsen.vsc-rename-files"
vscode "amodio.tsl-problem-matcher"
vscode "andrejunges.handlebars"
vscode "angular.ng-template"
vscode "antfu.iconify"
vscode "antfu.slidev"
vscode "anweber.vscode-httpyac"
vscode "arjun.swagger-viewer"
vscode "asciidoctor.asciidoctor-vscode"
vscode "astro-build.astro-vscode"
vscode "bazelbuild.vscode-bazel"
vscode "bee.git-temporal-vscode"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-yaml-preamble"
vscode "byi8220.indented-block-highlighting"
vscode "connor4312.esbuild-problem-matchers"
vscode "d-koppenhagen.file-tree-to-text-generator"
vscode "d-koppenhagen.vscode-code-review"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deque-systems.vscode-axe-linter"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "fcrespo82.markdown-table-formatter"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "george-alisson.html-preview-vscode"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
vscode "greenbyte.handlebars-preview"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "henrynguyen5-vsc.vsc-nvm"
vscode "html-validate.vscode-html-validate"
vscode "ibm.output-colorizer"
vscode "ilkka.google-java-format"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "knisterpeter.vscode-commitizen"
vscode "kravets.vscode-publint"
vscode "kumar-harsh.graphql-for-vscode"
vscode "liamhammett.inline-parameters"
vscode "lokalise.i18n-ally"
vscode "louiswt.regexp-preview"
vscode "lucono.karma-test-explorer"
vscode "marlon407.code-groovy"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mike-co.import-sorter"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "nathanchapman.javascriptsnippets"
vscode "naumovs.color-highlight"
vscode "nicollasr.vscode-streamdeck"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "pnp.polacode"
vscode "pranaygp.vscode-css-peek"
vscode "pwabuilder.pwa-studio"
vscode "raywiis.png-image-diff"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "richardkotze.git-mob"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rvanbekkum.xliff-sync"
vscode "samverschueren.linter-xo"
vscode "shakram02.bash-beautify"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-german"
vscode "stylelint.vscode-stylelint"
vscode "sygene.auto-correct"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tobermory.es6-string-html"
vscode "tomasdahlqvist.markdown-admonitions"
vscode "tyriar.luna-paint"
vscode "unifiedjs.vscode-mdx"
vscode "valentjn.vscode-ltex"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "vunguyentuan.vscode-css-variables"
vscode "xabikos.javascriptsnippets"
vscode "xyc.vscode-mdx-preview"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
krew "ns"
npm "corepack"
