tap "adoptopenjdk/openjdk"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jakehilborn/jakehilborn"
brew "aom"
brew "icu4c"
brew "boost"
brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gdbm"
brew "gettext"
brew "libffi"
brew "pcre"
brew "readline"
brew "sqlite"
brew "xz"
brew "python@3.8"
brew "glib"
brew "lzo"
brew "openssl"
brew "pixman"
brew "cairo"
brew "gmp"
brew "libevent"
brew "libunistring"
brew "libtool"
brew "libidn2"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "emacs"
brew "cask"
brew "coreutils"
brew "docker"
brew "docker-machine"
brew "doitlive"
brew "libogg"
brew "flac"
brew "frei0r"
brew "fribidi"
brew "giflib"
brew "graphite2"
brew "harfbuzz"
brew "jpeg"
brew "lame"
brew "libtiff"
brew "little-cms2"
brew "openjpeg"
brew "webp"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libvorbis"
brew "opus"
brew "libsndfile"
brew "libsamplerate"
brew "libsoxr"
brew "libvpx"
brew "opencore-amr"
brew "rtmpdump"
brew "rubberband"
brew "sdl2"
brew "snappy"
brew "speex"
brew "tesseract"
brew "theora"
brew "x264"
brew "x265"
brew "xvid"
brew "ffmpeg"
brew "isl"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "gifsicle"
brew "pcre2"
brew "git"
brew "glances"
brew "glew"
brew "gnu-sed"
brew "go"
brew "sdl2_image"
brew "gource"
brew "ncurses"
brew "htop"
brew "ilmbase"
brew "libde265"
brew "shared-mime-info"
brew "libheif"
brew "libomp"
brew "openexr"
brew "imagemagick"
brew "mas"
brew "rename"
brew "jq"
brew "krb5"
brew "minikube"
brew "mkdocs"
brew "mysql"
brew "node"
brew "nvm"
brew "openapi-generator"
brew "perl"
brew "postgresql"
brew "pre-commit"
brew "pyenv"
brew "rabbitmq"
brew "ruby"
brew "sonar-scanner"
brew "sonarqube"
brew "sourcekitten"
brew "termtosvg"
brew "vim", link: false
brew "wget"
brew "xcproj"
brew "zlib"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "jakehilborn/jakehilborn/displayplacer"
cask "adoptopenjdk8"
cask "android-sdk"
cask "cakebrew"
cask "chromium"
cask "firefox"
cask "font-hack-nerd-font"
cask "gimp"
cask "visual-studio-code"
cask "java8"
cask "caskroom/fonts/font-hack-nerd-font"
mas "com.alice.mac.go2shell", id: 445770608
mas "CopyClip", id: 595191960
mas "HP Easy Scan", id: 967004861
mas "Microsoft OneNote", id: 784801555
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
